[{"path":"/wiki/tab/a29052022053501","title":"Web App","content":"Add to home screen as app feature is available now for both Android and iOS. We highly recommended you to add oxyanime.to to home screen so that every of your next visit will be visiting the genuine oxyanime.to.","image":"https://i.imgur.com/tzR44ch.jpg"},{"path":"/detail/one-piece/21","title":"One piece","content":"Gol D. Roger was known as the \"Pirate King,\" the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece.","image":"https://i.imgur.com/HtOfJLs.jpg"},{"path":"/detail/boku-no-hero-academia-6th-season/49918","title":"My Hero Academia S6","content":"One day, a four-year-old boy came to a sudden realization: the world is not fair. Eighty percent of the world's population wield special abilities, known as \"quirks,\" which have given many the power to make their childhood dreams of becoming a superhero a reality. Unfortunately, Izuku Midoriya was one of the few born without a quirk, suffering from discrimination because of it. Yet, he refuses to give up on his dream of becoming a hero; determined to do the impossible, Izuku sets his sights on the elite hero training academy, UA High.","image":"https://i.imgur.com/F8dfBhN.jpg"},{"path":"/detail/fumetsu-no-anata-e-2nd-season/49709","title":"To Your Eternity S2","content":"At first, It is a sphere. Then, It imitates the form of a rock. As the temperature drops and snow falls atop the moss, It inherits the moss. When an injured, lone wolf comes limping by and lays down to die, It takes on the form of the animal. Finally, It gains consciousness and begins to traverse the empty tundra until It meets a boy.","image":"https://i.imgur.com/5iwgCFo.jpg"},{"path":"/detail/maou-gakuin-no-futekigousha-shijou-saikyou-no-maou-no-shiso-tensei-shite-shison-tachi-no-gakkou-e-kayou-2nd-season-part-2/48417","title":"The Misfit of Demon King Academy S2","content":"In the distant past, a war between humans and demons brought about widespread chaos and bloodshed. To put an end to this seemingly endless conflict, Demon King Anos Voldigoad willingly sacrificed his life, hoping to be reborn in a peaceful future.","image":"https://i.imgur.com/TXMeQ5M.jpg"},{"path":"/detail/otonari-no-tenshi-sama-ni-itsunomanika-dame-ningen-ni-sareteita-ken/50739","title":"The Angel Next Door Spoils Me Rotten","content":"After catching a cold by giving his only umbrella to a girl sitting in the rain, Amane Fujimiya only expects her to eventually return it. However, Mahiru Shiina, the \"Angel\" of Amane's school and his neighbor, instead gives him a lot more than that.","image":"https://i.imgur.com/MtXxgvC.jpg"},{"path":"/detail/kyokou-suiri-2nd-season/44204","title":"Kyokou Suiri S2","content":"God of Wisdom Kotoko Iwanaga has served as a mediator between the two realms, resolving any supernatural problems that come her way.","image":"https://i.imgur.com/Y7WtdYd.jpg"},{"path":"/detail/ningen-fushin-no-boukensha-tachi-ga-sekai-wo-sukuu-you-desu/49612","title":"Ningen Fushin no Boukensha-tachi ga Sekai wo Sukuu you desu","content":"A party of adventurers united in their belief that humans are bastards and desire to make some honest coin.","image":"https://i.imgur.com/5kSfLm1.jpg"},{"path":"/detail/saikyou-onmyouji-no-isekai-tenseiki-geboku-no-youkai-domo-ni-kurabete-monster-ga-yowasugirunda-ga/50932","title":"Saikyou Onmyouji no Isekai Tenseiki","content":"After the betrayal of his companions, Haruyoshi, the strongest diviner, was on the verge of dying. Hoping to be happy in the next life, he attempted the secret reincarnation technique and was sent to a different world!","image":"https://i.imgur.com/9N0uVNy.jpg"},{"path":"/detail/vinland-saga-season-2/49387","title":"Vinland Saga S2","content":"A new millennium begins in the southern part of the Jutland peninsula in Denmark. Thorfin was bought by the landowner Ketil as a \"slave\" and engaged in land reclamation work on his farm. Thorfinn meets a young man there, Einar, who was also a slave like him.","image":"https://i.imgur.com/a5fXnYm.jpg"},{"path":"/detail/tokyo-revengers-seiya-kessen-hen/50608","title":"Tokyo Revengers S2","content":"Takemichi can alter the flow of time. Given the chance to prevent his ex-girlfriend's tragic death at the hands of the Tokyo Manji Gang, Takemichi decides to fly through time to change the course of the future.","image":"https://i.imgur.com/djEBfHX.jpg"},{"path":"/detail/tensei-oujo-to-tensai-reijou-no-mahou-kakumei/52736","title":"The Magical Revolution of the Reincarnated Princess and the Genius Young Lady","content":"Despite her supposed ineptitude with regular magic, Princess Anisphia defies the aristocracy's expectations by developing \"magicology,\" a unique magical theory based on memories from her past life.","image":"https://i.imgur.com/ZiuDQ3A.jpg"}]